# BendingDetailTypeRadialDimensionTypeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeRadialDimensionTypeId Property
ParameterTypeId Class See Also
---
"Radial Dimension Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeRadialDimensionTypeId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeRadialDimensionTypeId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeRadialDimensionTypeId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace